cask_args appdir: "/Applications"
tap "borkdude/brew"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "saulpw/vd"
tap "thoughtbot/formulae"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bison"
brew "chruby"
brew "circleci"
brew "clojure"
brew "clojurescript"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "gawk"
brew "gdbm"
brew "gist"
brew "git"
brew "git-absorb"
brew "go"
brew "graphviz"
brew "haskell-stack"
brew "heroku"
brew "httpie"
brew "hub"
brew "ispell"
brew "jq"
brew "kubernetes-cli"
brew "leiningen"
brew "libffi"
brew "libyaml"
brew "lua"
brew "luarocks"
brew "lumo"
brew "markdown"
brew "mas"
brew "maven"
brew "mitmproxy"
brew "nginx"
brew "node@8"
brew "openssl"
brew "packer"
brew "postgresql"
brew "pv"
brew "rabbitmq"
brew "readline"
brew "redis"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rtmpdump"
brew "ruby-install"
brew "rustup"
brew "shellcheck"
brew "terraform"
brew "tmux"
brew "tree"
brew "v8"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "borkdude/brew/clj-kondo"
brew "heroku/brew/heroku-node"
brew "d12frosted/emacs-plus/emacs-plus"
brew "saulpw/vd/visidata"
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "atom"
cask "bartender"
cask "cold-turkey-blocker"
cask "dash"
cask "deckset"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-hangouts"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "intellij-idea-ce"
cask "kindle"
cask "leanpub"
cask "microsoft-office"
cask "muzzle"
cask "netlogo"
cask "plex-media-server"
cask "slack"
cask "sloth"
cask "sonos"
cask "soulver"
cask "steam"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Fantastical 2", id: 975937182
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Pages", id: 409201541
mas "Reeder", id: 1449412482
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Tadam", id: 531349534
mas "Things3", id: 904280696
