cask_args appdir: "/Applications"
tap "borkdude/brew"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"

# Java is a prerequisite for some applications
cask "adoptopenjdk"
cask "adoptopenjdk8"
cask "corretto"
cask "corretto8"

brew "adr-tools"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bison"
brew "borkdude/brew/clj-kondo"
brew "chruby"
brew "circleci"
brew "clojure"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "d12frosted/emacs-plus/emacs-plus"
brew "ffmpeg"
brew "flyway"
brew "gawk"
brew "gdbm"
brew "gist"
brew "git"
brew "git-absorb"
brew "go"
brew "graphviz"
brew "hadolint"
brew "heroku"
brew "heroku/brew/heroku-node"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "ispell"
brew "jenv"
brew "jq"
brew "kotlin"
brew "leiningen"
brew "libffi"
brew "libyaml"
brew "lua"
brew "mas"
brew "maven"
brew "mitmproxy"
brew "nginx"
brew "node"
brew "openssl"
brew "postgresql"
brew "pv"
brew "rabbitmq"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rtmpdump"
brew "ruby-install"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "terraform"
brew "thoughtbot/formulae/rcm"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
cask "1password"
cask "1password-cli"
cask "aerial"
cask "alacritty"
cask "alfred"
cask "anylist"
cask "appcleaner"
cask "atom"
cask "bartender"
cask "cmake"
cask "dash"
cask "deckset"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-cascadia"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-hangouts"
cask "gpg-suite"
cask "hammerspoon"
cask "iina"
cask "imageoptim"
cask "intellij-idea"
cask "keybase"
cask "kindle"
cask "muzzle"
cask "phantomjs"
cask "plex-media-server"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlvideo"
cask "quicklookase"
cask "quip"
cask "signal"
cask "slack"
cask "sonos"
cask "soulver"
cask "spotify"
cask "steam"
cask "sweet-home3d"
cask "textmate"
cask "thingsmacsandboxhelper"
cask "the-unarchiver"
cask "transmission"
cask "tweetbot"
cask "visual-studio-code"
cask "visualvm"
cask "zoomus"
mas "1Blocker", id: 1107421413
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Fantastical 2", id: 975937182
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Pages", id: 409201541
mas "Reeder", id: 1449412482
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Tadam", id: 531349534
mas "Things3", id: 904280696
mas "Xcode", id: 497799835
