# vim: set ft=ruby

tap "borkdude/brew"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

brew "adr-tools"
brew "ansible"
brew "asdf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bison"
brew "borkdude/brew/clj-kondo"
brew "clojure"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "ffmpeg"
brew "fish"
brew "gawk"
brew "gdbm"
brew "gist"
brew "git"
brew "git-absorb"
brew "git-lfs"
brew "gnupg"
brew "heroku"
brew "heroku/brew/heroku-node"
brew "ispell"
brew "jq"
brew "leiningen"
brew "libffi"
brew "libxml2"
brew "libyaml"
brew "lua"
brew "mas"
brew "maven"
brew "mitmproxy"
brew "nginx"
brew "openssl"
brew "pandoc"
brew "pinentry-mac"
brew "pkg-config"
brew "postgresql"
brew "pgformatter"
brew "pv"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rtmpdump"
brew "rustup"
brew "scc"
brew "shfmt"
brew "starship"
brew "terraform"
brew "rcm"
brew "tmux"
brew "tree"
brew "universal-ctags", args: %w(HEAD)
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask_args appdir: "/Applications"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alloy"
cask "anaconda"
cask "android-studio"
cask "anylist"
cask "appcleaner"
cask "atom"
cask "bartender"
cask "basictex"
cask "camo-studio"
cask "cleanshot"
cask "colorpicker-skalacolor"
cask "dash"
cask "deckset"
cask "docker"
cask "dropbox"
cask "dynamodb-local"
cask "firefox-developer-edition"
cask "font-cascadia"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-hangouts"
cask "grammarly"
cask "hey"
cask "imageoptim"
cask "intellij-idea"
cask "kindle"
cask "lunar"
cask "mochi"
cask "microsoft-edge"
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "plex-media-server"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlvideo"
cask "quicklookase"
cask "quip"
cask "rectangle"
cask "screenflow"
cask "signal"
cask "slack"
cask "sonos"
cask "soulver"
cask "spotify"
cask "steam"
cask "sweet-home3d"
cask "textmate"
cask "tla-plus-toolbox"
cask "thingsmacsandboxhelper"
cask "the-unarchiver"
cask "transmission"
cask "tweetbot"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "zsa-wally"

mas "1Blocker", id: 1107421413
mas "Bear", id: 1091189122
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Fantastical", id: 975937182
mas "Instapaper", id: 288545208
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Tadam", id: 531349534
mas "Things", id: 904280696
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590

host_brews = File.expand_path(".Brewfile.host", __dir__)
instance_eval(File.read(host_brews), host_brews) if File.exist?(host_brews)
