tap "InstantClientTap/instantclient"

cask "android-studio"
brew "ansible"
brew "circleci"
brew "dive"
brew "docker-credential-helper-ecr"
brew "gimme-aws-creds"
brew "gpgme"
brew "go"
brew "hadolint"
brew "imagemagick@6"
brew "instantclient-basic"
brew "instantclient-sdk"
brew "kafka"
brew "kotlin"
brew "tmate"

cask "microsoft-edge"
cask "pritunl"
cask "zoom"

mas "Okta Extension App", id: 1439967473
