tap "InstantClientTap/instantclient"

cask "android-studio"
brew "ansible"
brew "circleci"
brew "dive"
brew "docker-credential-helper-ecr"
brew "gimme-aws-creds"
brew "gpgme"
brew "go"
brew "hadolint"
brew "imagemagick@6"
brew "instantclient-basic"
brew "instantclient-sdk"
brew "kafka"
brew "kotlin"

cask "appcleaner"
cask "dash"
cask "dynamodb-local"
cask "lunar"
cask "pritunl"
cask "vagrant"
cask "quip"
cask "virtualbox"

mas "Okta Extension App", id: 1439967473
